:PROPERTIES:
:ID:       92b89b24-5aca-43ba-905c-1402fb827b8f
:END:
#+title: lua
#+date: [2024-08-07 三]
#+last_modified:  


* Table
Table is the only Type in Lua.When your call a function in module,
your can say you use a string to find a function in a table.

#+NAME: wether
#+BEGIN_SRC lua :results output
  a_table = {} -- define a table
  k = "today" -- k is a string that is a object
  a_table[k] = "is rain." -- key "today" in a_table reference to string "is rain."
  print("tody")
  print(a_table[k])
#+END_SRC 

#+RESULTS:
: tody 
: is rain.


variable holds reference to table.
Different variable can holds reference to the same table.
#+HEADER:  :noweb yes
#+BEGIN_SRC lua :results output
  <<wether>>
  ya_table = a_table
  print("and tomorrow")
  print(ya_table[k])
#+END_SRC 

#+RESULTS:
: tody
: is rain.
: and tomorrow
: is rain.

Variable is Root of GC. When no variable references to a table
that will be collected.
All Global variables are stored in a global table of lua VM.


Table can serve as a object.

#+BEGIN_SRC lua :results output
  <<wether>>
  print("after tomorrow")
  print(a_table.today)
#+END_SRC 

#+RESULTS:
: tody
: is rain.
: after tomorrow
: is rain.

You always can use a string to look up in a table, making it confusing
if type of a key is a String.

In lua, 2.0 will be cast to int for shorting memory. eg. 2 == 2.0 will return true



A Table can be initialized with index and value. in this case, table look like a array.
#+BEGIN_SRC lua :results output
  a_table2 ={"Monday", "Tuesday"}
  print(a_table2[1])
  print(a_table2[2])
#+END_SRC 
Note!! index starts from 1, instead of 0.


Your can initialize a table with key-value.

#+BEGIN_SRC lua :results output
  a_table3 = {Monday="is rain", Tuesday="is sunny"}
  print(a_table3["Monday"])
  print(a_table3["tuesday"])
#+END_SRC 

#+RESULTS:
: is rain
: nil

Two initialized method can be used in mix.


#+BEGIN_SRC lua :results output
  a_table4 = {Monday="is rain", Tuesday="is sunny",
  "a", "b", Sunday="is cloud", "c"}

  print(a_table4["Monday"])
  print(a_table4[1])
  print(a_table4["Sunday"])
  print(a_table4[3])
#+END_SRC 

#+RESULTS:
: is rain
: a
: is cloud
: c




